 //声明省
        var pres = ["湖南","北京", "上海", "山东","重庆","天津","海南","四川","广东","湖北"]; //直接声明Array
         //声明市
        var cities = [
        	["请选择","长沙", "株洲", "湘潭","衡阳","邵阳","岳阳","常德","张家界","益阳","郴州","永州","怀化","娄底","湘西土家族苗族自治州"],
        	["请选择","北京"],
        	["请选择","上海"],
            ["请选择","济南", "青岛"],
            ["请选择","重庆"],
            ["请选择","天津"],
            ["请选择","海口","三亚",'五指山','琼海','儋州','文昌','万宁','东方','定安县','屯昌县','澄迈县','临高县','白沙黎族自治县','昌江黎族自治县','乐东黎族自治县','陵水黎族自治县','保亭黎族苗族自治县','琼中黎族苗族自治县','西沙群岛','南沙群岛','中沙群岛的岛礁及其海域'],
        	["请选择","成都","自贡","攀枝花","泸州","德阳","绵阳","广元","遂宁","内江","乐山","南充","眉山","宜宾","广安","达州","雅安","巴中","资阳","阿坝藏族羌族自治州","甘孜藏族自治州","凉山彝族自治州"],
        	["请选择","广州","韶关","深圳","珠海","汕头","佛山","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮"],
        	["请选择","武汉","黄石","十堰","宜昌","襄樊","鄂州","荆门","孝感","荆州","黄冈","咸宁","随州","恩施土家族苗族自治州","省直辖行政单位"]
        ];
       
        var areas = [
	        	 [
	        		 ["请选择"],
	                 ["请选择",'芙蓉区','天心区','岳麓区','开福区','雨花区','长沙县','望城县','宁乡县','浏阳市'],
	                 ["请选择",'荷塘区','芦淞区','石峰区','天元区','株洲县','攸　县','茶陵县','炎陵县','醴陵市'],
	                 ["请选择",'雨湖区','岳塘区','湘潭县','湘乡市','韶山市'],
	                 ["请选择",'珠晖区','雁峰区','石鼓区','蒸湘区','南岳区','衡阳县','衡南县','衡山县','衡东县','祁东县','耒阳市','常宁市'],
	                 ["请选择",'双清区','大祥区','北塔区','邵东县','新邵县','邵阳县','隆回县','洞口县','绥宁县','新宁县','城步苗族自治县','武冈市'],
	                 ["请选择",'岳阳楼区','云溪区','君山区','岳阳县','华容县','湘阴县','平江县','汨罗市','临湘市'],
	                 ["请选择",'武陵区','鼎城区','安乡县','汉寿县','澧　县','临澧县','桃源县','石门县','津市市'],
	                 ["请选择",'永定区','武陵源区','慈利县','桑植县'],
	                 ["请选择",'资阳区','赫山区','南　县','桃江县','安化县','沅江市'],
	                 ["请选择",'北湖区','苏仙区','桂阳县','宜章县','永兴县','嘉禾县','临武县','汝城县','桂东县','安仁县','资兴市'],
	                 ["请选择",'芝山区','冷水滩区','祁阳县','东安县','双牌县','道　县','江永县','宁远县','蓝山县','新田县','江华瑶族自治县'],
	                 ["请选择",'鹤城区','中方县','沅陵县','辰溪县','溆浦县','会同县','麻阳苗族自治县','新晃侗族自治县','芷江侗族自治县','靖州苗族侗族自治县','通道侗族自治县','洪江市'],
	                 ["请选择",'娄星区','双峰县','新化县','冷水江市','涟源市'],
	                 ["请选择",'吉首市','泸溪县','凤凰县','花垣县','保靖县','古丈县','永顺县','龙山县']
	                 /*["请选择",],
	                 ["请选择",],*/
	             ],
                [
                	 ["请选择"],
                     ["请选择",'东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区','密云县','延庆县'] 
                ],
                [
                	["请选择"],
                	["请选择",'崇明县','黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']
                ],
                [	
                	["请选择"],
                    ["请选择","济南1", "济南2"],
                    ["请选择","青岛1", "青岛2"]
                ],
                [
                	["请选择"],
                    ["请选择",'万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']
                ],
                [
                	["请选择"],
                    ["请选择",'和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区','宁河县','静海县','蓟　县']
                ],
	        	[
	        		["请选择"],
	                ["请选择",'秀英区','龙华区','琼山区','美兰区']
	            ],
	            [
	        		["请选择"],
	                ["请选择",'锦江区','青羊区','金牛区','武侯区','成华区','龙泉驿区','青白江区','新都区','温江县','金堂县','双流县','郫　县','大邑县','蒲江县','新津县','都江堰市','彭州市','邛崃市','崇州市'],
	                ["请选择",'自流井区','贡井区','大安区','沿滩区','荣　县','富顺县'],
	                ["请选择",'东　区','西　区','仁和区','米易县','盐边县'],
	                ["请选择",'江阳区','纳溪区','龙马潭区','泸　县','合江县','叙永县','古蔺县'],
	                ["请选择",'旌阳区','中江县','罗江县','广汉市','什邡市','绵竹市'],
	                ["请选择",'涪城区','游仙区','三台县','盐亭县','安　县','梓潼县','北川羌族自治县','平武县','江油市'],
	                ["请选择",'市中区','元坝区','朝天区','旺苍县','青川县','剑阁县','苍溪县'],
	                ["请选择",'船山区','安居区','蓬溪县','射洪县','大英县'],
	                ["请选择",'市中区','东兴区','威远县','资中县','隆昌县'],
	                ["请选择",'市中区','沙湾区','五通桥区','金口河区','犍为县','井研县','夹江县','沐川县','峨边彝族自治县','马边彝族自治县','峨眉山市'],
	                ["请选择",'顺庆区','高坪区','嘉陵区','南部县','营山县','蓬安县','仪陇县','西充县','阆中市'],
	                ["请选择",'东坡区','仁寿县','彭山县','洪雅县','丹棱县','青神县'],
	                ["请选择",'翠屏区','宜宾县','南溪县','江安县','长宁县','高　县','珙　县','筠连县','兴文县','屏山县'],
	                ['广安区','岳池县','武胜县','邻水县','华莹市'],
	                ["请选择",'通川区','达　县','宣汉县','开江县','大竹县','渠　县','万源市'],
	                ["请选择",'雨城区','名山县','荥经县','汉源县','石棉县','天全县','芦山县','宝兴县'],
	                ["请选择",'巴州区','通江县','南江县','平昌县'],
	                ["请选择",'雁江区','安岳县','乐至县','简阳市'],
	                ["请选择",'汶川县','理　县','茂　县','松潘县','九寨沟县','金川县','小金县','黑水县','马尔康县','壤塘县','阿坝县','若尔盖县','红原县'],
	                ["请选择",'康定县','泸定县','丹巴县','九龙县','雅江县','道孚县','炉霍县','甘孜县','新龙县','德格县','白玉县','石渠县','色达县','理塘县','巴塘县','乡城县','稻城县','得荣县'],
	                ["请选择",'西昌市','木里藏族自治县','盐源县','德昌县','会理县','会东县','宁南县','普格县','布拖县','金阳县','昭觉县','喜德县','冕宁县','越西县','甘洛县','美姑县','雷波县']
	            ],
	            [
	        		["请选择"],
	                ["请选择",'东山区','荔湾区','越秀区','海珠区','天河区','芳村区','白云区','黄埔区','番禺区','花都区','增城市','从化市'],
	                ["请选择",'武江区','浈江区','曲江区','始兴县','仁化县','翁源县','乳源瑶族自治县','新丰县','乐昌市','南雄市'],
	                ["请选择",'罗湖区','福田区','南山区','宝安区','龙岗区','盐田区'],
	                ["请选择",'香洲区','斗门区','金湾区'],
	                ["请选择",'旌阳区','龙湖区','金平区','濠江区','潮阳区','潮南区','澄海区','南澳县'],
	                ["请选择",'禅城区','南海区','顺德区','三水区','高明区'],
	                ["请选择",'蓬江区','江海区','新会区','台山市','开平市','鹤山市','恩平市'],
	                ["请选择",'赤坎区','霞山区','坡头区','麻章区','遂溪县','徐闻县','廉江市','雷州市','吴川市'],
	                ["请选择",'茂南区','茂港区','电白县','高州市','化州市','信宜市'],
	                ["请选择",'端州区','鼎湖区','广宁县','怀集县','封开县','德庆县','高要市','四会市'],
	                ["请选择",'惠城区','惠阳区','博罗县','惠东县','龙门县'],
	                ["请选择",'梅江区','梅　县','大埔县','丰顺县','五华县','平远县','蕉岭县','兴宁市'],
	                ["请选择",'城　区','海丰县','陆河县','陆丰市'],
	                ['广安区','源城区','紫金县','龙川县','连平县','和平县','东源县'],
	                ["请选择",'江城区','阳西县','阳东县','阳春市'],
	                ["请选择",'清城区','佛冈县','阳山县','连山壮族瑶族自治县','连南瑶族自治县','清新县','英德市','连州市'],
	                ["请选择",'东莞市'],
	                ["请选择",'中山市'],
	                ["请选择",'湘桥区','潮安县','饶平县'],
	                ["请选择",'榕城区','揭东县','揭西县','惠来县','普宁市'],
	                ["请选择",'云城区','新兴县','郁南县','云安县','罗定市']
	            ],
	            [
	            	["请选择"],
	                ["请选择",'江岸区','江汉区','乔口区','汉阳区','武昌区','青山区','洪山区','东西湖区','汉南区','蔡甸区','江夏区','黄陂区','新洲区'],
	                ["请选择",'黄石港区','西塞山区','下陆区','铁山区','阳新县','大冶市'],
	                ["请选择",'茅箭区','张湾区','郧　县','郧西县','竹山县','竹溪县','房　县','丹江口市'],
	                ["请选择",'西陵区','伍家岗区','点军区','猇亭区','夷陵区','远安县','兴山县','秭归县','长阳土家族自治县','五峰土家族自治县','宜都市','当阳市','枝江市'],
	                ["请选择",'襄城区','樊城区','襄阳区','南漳县','谷城县','保康县','老河口市','枣阳市','宜城市'],
	                ["请选择",'梁子湖区','华容区','鄂城区'],
	                ["请选择",'东宝区','掇刀区','京山县','沙洋县','钟祥市'],
	                ["请选择",'孝南区','孝昌县','大悟县','云梦县','应城市','安陆市','汉川市'],
	                ["请选择",'沙市区','荆州区','公安县','监利县','江陵县','石首市','洪湖市','松滋市'],
	                ["请选择",'黄州区','团风县','红安县','罗田县','英山县','浠水县','蕲春县','黄梅县','麻城市','武穴市'],
	                ["请选择",'咸安区','嘉鱼县','通城县','崇阳县','通山县','赤壁市'],
	                ["请选择",'曾都区','广水市'],
	                ["请选择",'恩施市','利川市','建始县','巴东县','宣恩县','咸丰县','来凤县','鹤峰县'],
	                ['请选择','仙桃市','潜江市','天门市','神农架林区']
	                
            		]
            	
	            ]
	            	
            
            //设置一个省的公共下标
        var pIndex = -1;
        var preEle = document.getElementById("pre");
        var cityEle = document.getElementById("city");
        var areaEle = document.getElementById("area");
       
         //先设置省的值
        for (var i = 0; i < pres.length; i++) {
            //声明option.<option value="pres[i]">Pres[i]</option>
        	
        	 var ops = new Option(pres[i], i);
           
            //添加
            preEle.options.add(ops);
           
            
        } 
        
        var t;
        function chg(obj) {
        	var val = obj.selectedIndex;//可设置或返回下拉列表中被选选项的索引号
        	var pretext=preEle.options[val].text;
        	t=pretext+",";
        	$("#preFind").val(t);
            if (obj.value == -1) {
            	cityEle.options.length = 0;
                areaEle.options.length = 0;
            }
            //获取值
            var val = obj.value;
            pIndex = obj.value;
            //获取ctiry
            var cs = cities[val];
            
            //获取默认区
            var as = areas[val][0];
            //先清空市
            cityEle.options.length = 0;
            areaEle.options.length = 0;
            for (var i = 0; i < cs.length; i++) {
                var op = new Option(cs[i], i);
                cityEle.options.add(op);
            }
            for (var i = 0; i < as.length; i++) {
                var op = new Option(as[i], i);
                areaEle.options.add(op);
            }
        }
        var t2;
        function chg2(obj) {
            var val = obj.selectedIndex;//可设置或返回下拉列表中被选选项的索引号
            var citytext=cityEle.options[val].text;
           /* $("#preFind").val($("#preFind").val()+citytext+",");*/
            if(citytext=="请选择"){
            	t2=t;
            }else{
            	 t2=t+citytext+",";
            }
            $("#preFind").val(t2);
            var as = areas[pIndex][val];
            var ass = areas[pIndex][0];
            areaEle.options.length = 0;
            for (var i = 0; i < as.length; i++) { 
                var op = new Option(as[i], i);
                areaEle.options.add(op);
            }
        }
        var t3;
        function chg3(obj) {
            var val = obj.selectedIndex;//可设置或返回下拉列表中被选选项的索引号
            var areatext=areaEle.options[val].text;
            if(areatext=="请选择"){
            	t3=t2;
            }else{
            	t3=t2+areatext;    
            }
            $("#preFind").val(t3);
        }
       
        
        function shoAdd(){
    		for (var i = 0; i < pres.length; i++) {
    			if($("#sheng").val() == pres[i]){
    				 $("#pre").find("option:contains('"+pres[i]+"')").attr("selected",true);
    			}
            }
    		for (var i = 0; i < cities.length; i++) {
    			for(var j = 0; j < cities[i].length; j++){
    				if($("#fen").val() == cities[i][j]){
	       				var op = new Option(cities[i][j], j,true,true);
	       				cityEle.options.add(op);
    					
    				}
    			}
            }
    		for (var i = 0; i < areas.length; i++) {
    			for(var j = 0; j < areas[i].length; j++){
    				for(var z = 0; z < areas[i][j].length; z++){
    					if($("#qu").val() == areas[i][j][z]){
	   	       				 var op = new Option(areas[i][j][z], j,true,true);
	   	       				 areaEle.options.add(op);
    					}
    				}
    			}
            }
        }